      *************************
       IDENTIFICATION DIVISION.
      *************************
 
       PROGRAM-ID. ASBM2110.
 
       COPY XCWWCRHT.
 
      *****************************************************************
      **  MEMBER :  ASBM2110                                         **
      **  REMARKS:  PRINT NBS IMPORT AUDIT REPORT                    **
      **                                                             **
      **  DOMAIN :  PO                                               **
      **  CLASS  :  PD                                               **
      *****************************************************************
      **  DATE     AUTH.  DESCRIPTION                                **
      **                                                             **
      **  31JUL90  NBS    INITIAL NEW BUSINESS SYSTEM DESIGN         **
APEX52**  30NOV94  JJS    UPGRADE TO RELEASE 5.2,                    **
APEX52**                  COMBINED MESSAGES INTO ONE LINE            **
APEX53**  30NOV95  JJS    UPGRADE TO INGENIUM 5.3 & WINAPEX 1.0,     **
APEX53**                  ADD WORKING STORAGE COPYBOOK XCWWPGWS,     **
APEX53**                  CHANGES TO SUPPORT I/O PROGRAMS,           **
APEX53**                  SEPARATE GLOBAL AREA AND MIR               **
APEX54**  31DEC96  TJS    MODIFICATIONS FOR MAINTAINABILITY          **
007684**  30OCT98  56     CHECKPOINT/RESTART                         **
014590**  15DEC99  60     ARCHITECTURAL CHANGES                      **
B10065**  31AUG01  DPK    MODIFIED REPORT FOR FTJ                    **
P00008**  18OCT01  DPK    CLIENT ID IS NOT SHOWING FOR BASE CVG      **
P00045**  26OCT01  BMB    CORRECT CKPT RESTART LOGIC IN ASBM9400     **
P00045**                  MAKE SEQUENTIAL FILES, SEQUENTIAL TABLES   ** 
P00103**  05NOV01  DPK    ADDED MORE CLIENT FIELDS                   **
P00159**  15NOV01  DPK    ADDED A SECOND REPORT WHICH PAGE BREAKS    **
P00159**                  ON APP ID - ALL OTHER INFO IS THE SAME     **
B00995**  15AUG02  AC     ADDED R2110-CO-NM FOR CORPORATE OWNERSHIP  **
P01108**  08SEP03  SW     ADDED UW TYPE FIELD                        **
PR006Q**  01DEC03  SUG    ADD MY KEMPO TYPE CODE                     **
P01217**  14NOV03  CECIL  ADDED 3RD OUTPUT NSPRT9 FOR DOWNLOAD       **
B11215**  19DEC03  AT     POPULATE L2490 INSTANCE OF LANGUAGE CODE   **
B11215**                  WHEN RETRIEVING MY-KEMPO DESCRIPTIONS,     **
B11215**                  SHIFT MY-KEMPO DESCRIPTION TO THE RIGHT    **
P02229**  20OCT04  CY     ADD COMMIT LOGIC TO MAINLINES              **
UCPOUT**  13APR05  BP     ADD UCP FLAG AND DATE                      **
MFFOP1**  03OCT05  SW     ADD THREE FIELDS AND REMOVE AGENT ID       **
5-0569**  03OCT05  SW     ADJUST THE ALIGNMENT                       **
M16826**  21MAR12  NJ     INCLUDING CWA DATA IN THE REPORT           **
Q17251**  16APR12  CTS    ADDING PAGE BREAK CONDITION BASED ON RO    **
Q17251**  16APR12  CTS    CODE AND SO CODE                           **
MP270C**  03MAR16  CTS    CHANGES DONE AS A PART OF EPOS	     **
      *****************************************************************
 
      **********************
       ENVIRONMENT DIVISION.
      **********************
 
       CONFIGURATION SECTION.
 
       INPUT-OUTPUT SECTION.
 
       FILE-CONTROL.
 
Q17251* COPY NCSSPRT1.
Q17251 COPY CCSSPRTA.
P00159 COPY NCSSPRT2.
P01217 COPY NCSSPRT9.
P00045 COPY ACSS2110.
 
      ***************
       DATA DIVISION.
      ***************
 
       FILE SECTION.
 
Q17251* COPY NCSDPRT1.
Q17251* COPY NCSRPRT1.
Q17251 COPY CCSDPRTA.
Q17251 COPY CCSRPRTA.
P00159 COPY NCSDPRT2.
P00159 COPY NCSRPRT2.
P01217 COPY NCSDPRT9.
P01217 COPY NCSRPRT9.
 
P00045 COPY ACSD2110.
P00045 COPY ACSR2110.
      /
       WORKING-STORAGE SECTION.
 
APEX53 COPY XCWWPGWS REPLACING '$VAR1' BY 'ASBM2110'.
 
       01  CONSTANTS.
           05  WS-HOLD-DATA-REC              PIC X(133).
 
       01  WS-SWITCHES.
           05  WS-FIRST-PAGE-SW              PIC X  VALUE 'Y'.
               88  WS-FIRST-PAGE                    VALUE 'Y'.
               88  WS-NOT-FIRST-PAGE                VALUE 'N'.
P01217     05  WS-DATA-FIRST-SW             PIC X(01) VALUE 'Y'.
P01217         88  WS-DATA-FIRST                      VALUE 'Y'.
P01217         88  WS-NO-DATA-FIRST                   VALUE 'N'.
 
       01  WS-COUNTERS.
           05  WS-PAGE-CNTR                  PIC S9(04)
                                                    COMP VALUE ZEROS.
           05  WS-LINE-CNTR                  PIC S9(04)
                                                    COMP VALUE ZEROS.
P00159     05  WS-PAGE-CNTR2                 PIC S9(04)
P00159                                              COMP VALUE ZEROS.
APEX52     05  WS-MAX-LINES                  PIC S9(04)
                                                    COMP VALUE +50.
           05  WS-RECORDS-IN-COMPANY         PIC S9(04)
                                                    COMP VALUE ZEROS.
           05  WS-RECORDS-IN-TOTAL           PIC S9(04)
                                                    COMP VALUE ZEROS.
           05  WS-COMPANY-CNTR               PIC S9(04)
                                                    COMP VALUE ZEROS.
 
       01  WS-PROGRAM-WORK-AREA.
           05  WS-COMPANY-CODE               PIC X(02).
           05  WS-PREV-APP-NUMBER            PIC X(15).
           05  WS-PREV-STCKR-ID              PIC X(11).
           05  WS-PREV-CLIENT-NUMBER         PIC X(10).
Q17251     05  WS-PREV-BRANCH-CODE           PIC X(03).
Q17251     05  WS-PREV-SO-CODE               PIC X(03).
Q17251     05  WS-RO-KEY.
Q17251         10  WS-RO-ID                 PIC X(03).
Q17251         10  WS-RO-ZERO               PIC X(03).
Q17251         10  FILLER                   PIC X(04).
Q17251     05  WS-SO-KEY.
Q17251         10  WS-SO-BR                 PIC X(03).
Q17251         10  WS-SO-SO                 PIC X(03).
Q17251         10  FILLER                   PIC X(04).
 
M16826* 01  WS-PRINT-LINE.
M16826*     05  FILLER                        PIC X(01).
UCPOUT*    05  WS-P1-APP-NUMBER              PIC X(15).
M16826*UCPOUT     05  WS-P1-APP-NUMBER              PIC X(12).
M16826*     05  WS-P1-APP-NUMBER              PIC X(11).
P00103*    05  FILLER                        PIC X(01).
UCPOUT*    05  WS-P1-COMPANY-CODE            PIC X(02).
UCPOUT*    05  FILLER                        PIC X(02).
M16826*     05  FILLER                        PIC X(01).
M16826*     05  WS-P1-POLICY-ID               PIC X(10).
M16826*     05  WS-P1-POLICY-ID               PIC X(07).
P00103*    05  FILLER                        PIC X(01).
M16826*     05  FILLER                        PIC X(01).
M16826*MFFOP1     05  WS-PROD-APP-TYP-CD            PIC X(02).
M16826*MFFOP1     05  FILLER                        PIC X(04).
MFFOP1*    05  WS-POL-CNVR-TYP-CD            PIC X(01).
MFFOP1*    05  FILLER                        PIC X(01).
M16826*    05  WS-P1-BRANCH-CODE             PIC X(03).
M16826*     05  FILLER                        PIC X(02).
M16826*P00103     05  WS-P1-SO-CODE                 PIC X(03).
MFFOP1*P00103     05  FILLER                        PIC X(01).
M16826*MFFOP1     05  FILLER                        PIC X(02).
MFFOP1*    05  WS-P1-AGENT-CODE              PIC X(06).
UCPOUT*    05  FILLER                        PIC X(02).
MFFOP1*UCPOUT     05  FILLER                        PIC X(01).
B10065*    05  WS-P1-INSURED-NAME            PIC X(20).
P00103*    05  WS-P1-STCKR-ID                PIC X(11).
M16826*P00103     05  WS-P1-REPORT-DT               PIC X(10).
UCPOUT*P00103 05  FILLER                        PIC X(03).
M16826*UCPOUT     05  FILLER                        PIC X(01).
M16826*    05  WS-P1-CLIENT-NUMBER           PIC X(10).
M16826*    05  FILLER                        PIC X(01).
P00103*    05  WS-P1-CLI-NM                  PIC X(40).
UCPOUT*PR006Q 05  WS-P1-CLI-NM                  PIC X(31).
M16826*UCPOUT     05  WS-P1-CLI-NM                  PIC X(26).
M16826*P00103     05  FILLER                        PIC X(01).
M16826*P00103     05  WS-P1-CLI-BTH-DT              PIC X(10).
UCPOUT*P00103 05  FILLER                        PIC X(01).
5-0569*UCPOUT 05  FILLER                        PIC X(02).
M16826*5-0569     05  FILLER                        PIC X(03).
M16826*P00103     05  WS-P1-CLI-SEX-CD              PIC X(01).
M16826*P01108     05  FILLER                        PIC X(04).
M16826*P01108     05  WS-P1-UW-TYP-CD               PIC X(01).
B11215*PR006Q 05  FILLER                        PIC X(01).
UCPOUT*B11215 05  FILLER                        PIC X(04).
M16826*UCPOUT     05  FILLER                        PIC X(03).
MFFOP1*PR006Q     05  WS-P1-MY-KEMPO-TYP-CD         PIC X(08).
MFFOP1*UCPOUT     05  FILLER                        PIC X(02).
MFFOP1*UCPOUT     05  WS-P1-UCP-CD                  PIC X(01).
M16826*MFFOP1     05  WS-SEG-FUND-CD                PIC X(02).
5-0569*MFFOP1 05  FILLER                        PIC X(01).
M16826*5-0569     05  FILLER                        PIC X(04).
M16826*MFFOP1     05  WS-POL-CHNG-TYP-CD            PIC X(02).
5-0569*UCPOUT 05  FILLER                        PIC X(04).
M16826*5-0569     05  FILLER                        PIC X(04).
M16826*UCPOUT     05  WS-P1-UCP-ISS-DT              PIC X(10).
B10065*    05  WS-P1-BASE-PRODUCT            PIC X(07).
P00103*    05  WS-P1-BASE-PRODUCT            PIC X(40).
B10065*    05  FILLER                        PIC X(02).
B10065*    05  WS-P1-NUMBER-OF-RECS          PIC ZZ9.                                                           
M16826
M16826** REMOVED SEG FUND CODE AND UCP ISSUE DATE FROM THE LAYOUT
M16826*
M16826 01  WS-PRINT-LINE.
M16826     05  WS-P1-APP-NUMBER              PIC X(11).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-POLICY-ID               PIC X(07).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-PROD-APP-TYP-CD            PIC X(02).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-BRANCH-CODE             PIC X(03).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-SO-CODE                 PIC X(03).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-REPORT-DT               PIC X(10).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-CLIENT-NUMBER           PIC X(10).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-CLI-NM                  PIC X(20).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-CLI-BTH-DT              PIC X(10).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-CLI-SEX-CD              PIC X(01).
M16826     05  FILLER                        PIC X(02).
M16826     05  WS-P1-UW-TYP-CD               PIC X(01).
M16826     05  FILLER                        PIC X(02).
M16826     05  WS-POL-CHNG-TYP-CD            PIC X(02).
M16826     05  FILLER                        PIC X(02).
M16826     05  WS-P1-RECPT-DT                PIC X(10).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-RECPT-AMT               PIC X(15).
M16826     05  FILLER                        PIC X(01).
M16826     05  WS-P1-RECPT-NUM               PIC X(08). 
MP270C     05  FILLER                        PIC X(01).
MP270C     05  WS-P1-PAPR-LESS-CD            PIC X(01).
 
       01  WS-REPORT-LINES.
           05  FILLER                        PIC X(01).
           05  WS-HEADING-PART-1             PIC X(59).
           05  WS-HEADING-PART-2             PIC X(73).
       01  WS-REPORT-LINES-2.
           05  FILLER                        PIC X(01).
           05  WS-HEADING-PART-3             PIC X(59).
           05  WS-HEADING-PART-4             PIC X(73).
            
B10065 01  WS-END-OF-REPORT-LINE.
B10065     05  WS-END-OF-RPT-TXT             PIC X(50).
 
P01217 01  WS-XLS-LINE.
P01217     05  WS-XLS-DOC-ID                PIC X(12).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-RPRT-DT               PIC X(10).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-APP-NUMBER            PIC X(15).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-POL-500               PIC X(03).
P01217     05  WS-XLS-POLICY-ID             PIC X(10).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-BRANCH-CODE           PIC X(03).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-SO-CODE               PIC X(03).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-AGENT-CODE            PIC X(06).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-REPORT-DT             PIC X(10).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-CLIENT-NUMBER         PIC X(10).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-CLI-NM                PIC X(31).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-CLI-BTH-DT            PIC X(10).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-CLI-SEX-CD            PIC X(01).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
P01217     05  WS-XLS-UW-TYP-CD             PIC X(01).
P01217     05  FILLER                       PIC X(01)  VALUE ','.
MFFOP1*P01217     05  WS-XLS-MY-KEMPO-TYP-CD       PIC X(08).
MFFOP1*UCPOUT     05  FILLER                       PIC X(01)  VALUE ','.
MFFOP1*UCPOUT     05  WS-XLS-UCP-CD                PIC X(01).
MFFOP1*UCPOUT     05  FILLER                       PIC X(01)  VALUE ','.
UCPOUT     05  WS-XLS-UCP-ISS-DT            PIC X(10).
 
      /
       COPY XCWTFCMD.
      /
       COPY XCWWHDG.
      /
       COPY XCWWTIME.
      /
       COPY XCWWWKDT.
      /
       COPY ACSW2110.
P00045*COPY ACSR2110.
      /
       COPY XCSWOCF.
       COPY XCSROCF.
      /
Q17251* COPY NCSWPRT1.
Q17251 COPY CCSWPRTA.
P00159/
P00159 COPY NCSWPRT2.
P01217 COPY NCSWPRT9.
      /
       COPY NCWL0960.
       COPY SQLCA.
014590*COPY XCWL0030.
P02229 COPY XCWL0035.

       COPY XCWL0040.
       COPY XCWL1640.
       COPY XCWLDTLK.
B10065 COPY CCFWEDIT.
B10065 COPY CCFREDIT.
M16826 COPY CCFWPOL.
M16826 COPY CCFRPOL.
M16826 COPY CCFWCWAR.
M16826 COPY CCFRCWAR.
P00103 COPY CCWL0620.
M16826 COPY XCWL0290.
M16826 COPY XCWL9687.
MFFOP1*PR006Q COPY XCWL2490.
M16826 COPY XCWL2490.
      /
       01  WGLOB-GLOBAL-AREA.
       COPY XCWWGLOB.
      /
      ********************
       PROCEDURE DIVISION.
      ********************
 
      *--------------
       0000-MAINLINE.
      *--------------
 
           PERFORM  1000-OPEN-FILES
               THRU 1000-OPEN-FILES-X.
 
           PERFORM  2000-INITIALIZE-FIELDS
               THRU 2000-INITIALIZE-FIELDS-X.
 
           PERFORM  3000-PROCESS-TRANSACTIONS
               THRU 3000-PROCESS-TRANSACTIONS-X.
 
      *
      * PRINT THE GRAND TOTALS
      *
 
           PERFORM  8000-PRINT-TOTALS
               THRU 8000-PRINT-TOTALS-X.
 
           PERFORM  9000-CLOSE-FILES
               THRU 9000-CLOSE-FILES-X.
 
P02229     PERFORM  0035-1000-COMMIT
P02229         THRU 0035-1000-COMMIT-X.

           STOP RUN.
 
       0000-MAINLINE-X.
           EXIT.
      /
      *----------------
       1000-OPEN-FILES.
      *----------------
 
      *
      * OPEN ALL FILES
      *
 
           PERFORM  OCF-3000-OPEN-OUTPUT
               THRU OCF-3000-OPEN-OUTPUT-X.

P00045*    PERFORM  2110-1000-OPEN-INPUT
P00045*        THRU 2110-1000-OPEN-INPUT-X.
 
P00045     PERFORM  2110-3000-OPEN-INPUT
P00045         THRU 2110-3000-OPEN-INPUT-X.
 
Q17251*     PERFORM  PRT1-3000-OPEN-OUTPUT
Q17251*         THRU PRT1-3000-OPEN-OUTPUT-X.

Q17251     PERFORM  PRTA-3000-OPEN-OUTPUT
Q17251         THRU PRTA-3000-OPEN-OUTPUT-X.
 
P00159     PERFORM  PRT2-3000-OPEN-OUTPUT
P00159         THRU PRT2-3000-OPEN-OUTPUT-X.
 
P01217     PERFORM  PRT9-3000-OPEN-OUTPUT
P01217         THRU PRT9-3000-OPEN-OUTPUT-X.
P01217
       1000-OPEN-FILES-X.
           EXIT.
      /
      *-----------------------
       2000-INITIALIZE-FIELDS.
      *-----------------------
 
      *
      * INITIALIZE GLOBAL AREA AND CONTROL REPORT TITLES TO
      * DEFAULTS
      *
 
APEX53     MOVE WPGWS-CRNT-PGM-ID         TO L0960-PROGRAM-ID.
 
           PERFORM  0960-2000-INIT-DEFAULT
               THRU 0960-2000-INIT-DEFAULT-X.
 
           PERFORM  7000-INIT-RUN-TITLES
               THRU 7000-INIT-RUN-TITLES-X.
 
       2000-INITIALIZE-FIELDS-X.
           EXIT.
      /
      *--------------------------
       3000-PROCESS-TRANSACTIONS.
      *--------------------------
 
      *
      * PROCESS TRANSACTIONS - SEQUENTIALLY READ THE IMPORT AUDIT
      * EXTRACT FILE AND PRINT EACH RECORD, BREAKING ON COMPANY
      *
 
           PERFORM  2110-1000-READ
               THRU 2110-1000-READ-X.
 
           PERFORM  4000-PROCESS-COMPANY
               THRU 4000-PROCESS-COMPANY-X.
B10065*        UNTIL W2110-SEQ-IO-EOF.
 
       3000-PROCESS-TRANSACTIONS-X.
           EXIT.
      /
      *---------------------
       4000-PROCESS-COMPANY.
      *---------------------
 
      *
      * PROCESS EACH COMPANY'S AUDIT POLICY RECORDS
      *
 
      *
      * INITIALIZE GLOBAL AREA AND CONTROL REPORT FOR COMPANY
      *
 
 
B10065*    MOVE R2110-COMPANY-CODE        TO WS-COMPANY-CODE.
B10065     MOVE SPACES                    TO WS-PREV-APP-NUMBER.
B10065     MOVE SPACES                    TO WS-PREV-STCKR-ID.
B10065     MOVE SPACES                    TO WS-PREV-CLIENT-NUMBER.
Q17251     MOVE SPACES                      TO WS-PREV-BRANCH-CODE.
Q17251     MOVE SPACES                      TO WS-PREV-SO-CODE.
Q17251     MOVE ZERO                        TO WS-LINE-CNTR.
Q17251     ADD 1                            TO WS-PAGE-CNTR.
Q17251     MOVE +0                          TO WPRTA-NUMBER-LINES.
Q17251
Q17251*    IF  WS-LINE-CNTR > WS-MAX-LINES
Q17251*        PERFORM  8200-PRINT-HEADINGS
Q17251*            THRU 8200-PRINT-HEADINGS-X
Q17251*    END-IF.

Q17251     IF  W2110-SEQ-IO-EOF
Q17251         PERFORM  8250-PRINT-HEADINGS
Q17251             THRU 8250-PRINT-HEADINGS-X
Q17251         GO TO 4000-PROCESS-COMPANY-X
Q17251     END-IF.
            
           PERFORM  4100-PROCESS-EXTRACTS
               THRU 4100-PROCESS-EXTRACTS-X 
               UNTIL W2110-SEQ-IO-EOF.
B10065*        OR    R2110-COMPANY-CODE NOT = WS-COMPANY-CODE.
 
 
       4000-PROCESS-COMPANY-X.
           EXIT.
      /
      *----------------------
       4100-PROCESS-EXTRACTS.
      *----------------------
 
P01217     PERFORM  4500-PROCESS-EXTRACTS-XLS
P01217         THRU 4500-PROCESS-EXTRACTS-XLS-X.
P01217*
      *
      * PRINT EXTRACT RECORDS
      *
 
           ADD +1                         TO WS-RECORDS-IN-COMPANY.
 
           MOVE SPACES                    TO WS-PRINT-LINE.

B10065     IF R2110-APP-NUMBER = WS-PREV-APP-NUMBER
P00008*       IF R2110-STCKR-ID = WS-PREV-STCKR-ID
P00008*          MOVE SPACES                 TO WS-P1-STCKR-ID
P00008*          MOVE SPACES                 TO WS-P1-CLIENT-NUMBER
P00008*       ELSE
P00103*       MOVE R2110-STCKR-ID         TO WS-P1-STCKR-ID
P00008*       MOVE R2110-STCKR-ID         TO WS-PREV-STCKR-ID
B10065        MOVE R2110-CLIENT-NUMBER    TO WS-P1-CLIENT-NUMBER
B00995        IF R2110-CLI-SEX-CD = 'C'
B00995           MOVE R2110-CLI-CO-NM     TO WS-P1-CLI-NM
B00995        ELSE
B00995           MOVE R2110-CLI-GIV-NM       TO L0620-CLI-GIV-NM
B00995           MOVE R2110-CLI-SUR-NM       TO L0620-CLI-SUR-NM
B00995           PERFORM  0620-1000-FORMAT-SCREEN-NAME
B00995              THRU  0620-1000-FORMAT-SCREEN-NAME-X
B00995           MOVE L0620-SCREEN-NAME      TO WS-P1-CLI-NM
B00995        END-IF
P00103        MOVE R2110-CLI-BTH-DT       TO WS-P1-CLI-BTH-DT
P00103        MOVE R2110-CLI-SEX-CD       TO WS-P1-CLI-SEX-CD
P01108        MOVE R2110-UW-TYP-CD        TO WS-P1-UW-TYP-CD
MP270C         IF  R2110-PAPR-LESS-APP-YES  
MP270C             MOVE '*'                 TO WS-P1-PAPR-LESS-CD
MP270C         ELSE
MP270C             MOVE SPACES              TO WS-P1-PAPR-LESS-CD
MP270C         END-IF
MP270C
M16826*MFFOP1        MOVE R2110-SEG-FUND-CD      TO WS-SEG-FUND-CD
P00008*       END-IF
P00103*       MOVE WGLOB-EDIT-LANG           TO WEDIT-ETBL-LANG-CD
P00103*       MOVE R2110-BASE-PRODUCT        TO WEDIT-ETBL-VALU-ID
P00103*       MOVE 'PLAN'                    TO WEDIT-ETBL-TYP-ID
P00103*       PERFORM  EDIT-1000-READ
P00103*          THRU  EDIT-1000-READ-X
P00103*       MOVE REDIT-ETBL-DESC-TXT       TO WS-P1-BASE-PRODUCT
Q17251*P00103        MOVE +1                        TO WPRT1-NUMBER-LINES
Q17251        MOVE +1                        TO WPRTA-NUMBER-LINES
Q17251
Q17251        PERFORM  8600-BUILD-PRTA-KEYS
Q17251            THRU 8600-BUILD-PRTA-KEYS-X
Q17251
Q17251*P00103        PERFORM  8300-PRINT-LINE
Q17251*P00103            THRU 8300-PRINT-LINE-X
Q17251        PERFORM  8350-PRINT-LINE
Q17251            THRU 8350-PRINT-LINE-X
P00159        PERFORM  8500-PRINT-LINE2
P00159            THRU 8500-PRINT-LINE2-X
           ELSE
P00159        PERFORM 8400-PRINT-HEADINGS2
MFFOP1*P00159     THRU 8400-PRINT-HEADINGS2
MFFOP1            THRU 8400-PRINT-HEADINGS2-X
              MOVE R2110-POLICY-ID           TO WS-P1-POLICY-ID
              MOVE R2110-APP-NUMBER          TO WS-P1-APP-NUMBER
UCPOUT*       MOVE R2110-COMPANY-CODE        TO WS-P1-COMPANY-CODE
MFFOP1*       MOVE R2110-AGENT-CODE          TO WS-P1-AGENT-CODE
              MOVE R2110-BRANCH-CODE         TO WS-P1-BRANCH-CODE
P00103        MOVE R2110-SO-CODE             TO WS-P1-SO-CODE
P00103        MOVE R2110-REPORT-DT           TO WS-P1-REPORT-DT
MFFOP1        MOVE R2110-PROD-APP-TYP-CD     TO WS-PROD-APP-TYP-CD
MFFOP1*       MOVE R2110-POL-CNVR-TYP-CD     TO WS-POL-CNVR-TYP-CD
MFFOP1        MOVE R2110-POL-CHNG-TYP-CD     TO WS-POL-CHNG-TYP-CD
MFFOP1*       MOVE R2110-SEG-FUND-CD         TO WS-SEG-FUND-CD
MFFOP1*PR006Q* GET MY KEMPO INFORMATION FOR THE POLICY
MFFOP1*PR006Q MOVE WPGWS-CRNT-PGM-ID         TO L2490-TXT-SRC-ID
MFFOP1*B11215 MOVE WGLOB-EDIT-LANG           TO L2490-TXT-LANG-CD 
MFFOP1*PR006Q EVALUATE TRUE
MFFOP1*PR006Q     WHEN R2110-MY-KEMPO-TYP-NO
MFFOP1*PR006Q          MOVE SPACE            TO WS-P1-MY-KEMPO-TYP-CD
MFFOP1*PR006Q     WHEN R2110-MY-KEMPO-TYP-MATURITY
MFFOP1*PR006Q          MOVE '00001'          TO L2490-TXT-SRC-REF-ID
MFFOP1*PR006Q          PERFORM  2490-1000-RETRIEVE-TEXT
MFFOP1*PR006Q              THRU 2490-1000-RETRIEVE-TEXT-X
MFFOP1*PR006Q          MOVE L2490-TXT-STR-TXT  TO WS-P1-MY-KEMPO-TYP-CD
MFFOP1*PR006Q     WHEN R2110-MY-KEMPO-TYP-MID-TERM
MFFOP1*PR006Q          MOVE '00002'            TO L2490-TXT-SRC-REF-ID
MFFOP1*PR006Q          PERFORM  2490-1000-RETRIEVE-TEXT
MFFOP1*PR006Q              THRU 2490-1000-RETRIEVE-TEXT-X
MFFOP1*PR006Q          MOVE L2490-TXT-STR-TXT  TO WS-P1-MY-KEMPO-TYP-CD
MFFOP1*PR006Q END-EVALUATE
MFFOP1*PR006Q
MFFOP1*UCPOUT MOVE R2110-UCP-CD              TO WS-P1-UCP-CD    
M16826*UCPOUT        MOVE R2110-UCP-ISS-DT          TO WS-P1-UCP-ISS-DT
UCPOUT
B10065*    MOVE R2110-INSURED-NAME        TO WS-P1-INSURED-NAME.
P00008*       IF R2110-STCKR-ID = WS-PREV-STCKR-ID
P00008*          MOVE SPACES                 TO WS-P1-STCKR-ID
P00008*          MOVE SPACES                 TO WS-P1-CLIENT-NUMBER
P00008*       ELSE
P00103*       MOVE R2110-STCKR-ID         TO WS-P1-STCKR-ID
              MOVE R2110-CLIENT-NUMBER    TO WS-P1-CLIENT-NUMBER
B00995        IF R2110-CLI-SEX-CD = 'C'
B00995           MOVE R2110-CLI-CO-NM     TO WS-P1-CLI-NM
B00995        ELSE
B00995           MOVE R2110-CLI-GIV-NM       TO L0620-CLI-GIV-NM
B00995           MOVE R2110-CLI-SUR-NM       TO L0620-CLI-SUR-NM
B00995           PERFORM  0620-1000-FORMAT-SCREEN-NAME
B00995              THRU  0620-1000-FORMAT-SCREEN-NAME-X
B00995           MOVE L0620-SCREEN-NAME      TO WS-P1-CLI-NM
B00995        END-IF
P00103        MOVE R2110-CLI-BTH-DT       TO WS-P1-CLI-BTH-DT
P00103        MOVE R2110-CLI-SEX-CD       TO WS-P1-CLI-SEX-CD
P01108        MOVE R2110-UW-TYP-CD        TO WS-P1-UW-TYP-CD
P00008*       END-IF
P00103*       MOVE WGLOB-EDIT-LANG           TO WEDIT-ETBL-LANG-CD
P00103*       MOVE R2110-BASE-PRODUCT        TO WEDIT-ETBL-VALU-ID
P00103*       MOVE 'PLAN'                    TO WEDIT-ETBL-TYP-ID
P00103*       PERFORM  EDIT-1000-READ
P00103*          THRU  EDIT-1000-READ-X
P00103*       MOVE REDIT-ETBL-DESC-TXT       TO WS-P1-BASE-PRODUCT
B10065        MOVE R2110-APP-NUMBER          TO WS-PREV-APP-NUMBER
P00008*       MOVE SPACES                    TO WS-PREV-STCKR-ID
B10065*       MOVE R2110-NUMBER-OF-RECS      TO WS-P1-NUMBER-OF-RECS
M16826        PERFORM  5000-GET-CWA-DATA
M16826            THRU 5000-GET-CWA-DATA-X
Q17251*P00103        MOVE +2                        TO WPRT1-NUMBER-LINES
Q17251        MOVE +2                        TO WPRTA-NUMBER-LINES
Q17251									     
Q17251        PERFORM  8600-BUILD-PRTA-KEYS
Q17251            THRU 8600-BUILD-PRTA-KEYS-X
Q17251
Q17251*P00103        PERFORM  8300-PRINT-LINE
Q17251*P00103            THRU 8300-PRINT-LINE-X
Q17251        PERFORM  8350-PRINT-LINE
Q17251            THRU 8350-PRINT-LINE-X
P00159        PERFORM  8500-PRINT-LINE2
P00159            THRU 8500-PRINT-LINE2-X
B10065     END-IF.
 
P00103*    MOVE +1                        TO WPRT1-NUMBER-LINES.
P00103*    PERFORM  8300-PRINT-LINE
P00103*        THRU 8300-PRINT-LINE-X.

Q17251     MOVE R2110-BRANCH-CODE           TO WS-PREV-BRANCH-CODE.
Q17251     MOVE R2110-SO-CODE               TO WS-PREV-SO-CODE.

           PERFORM  2110-1000-READ
               THRU 2110-1000-READ-X.
                
 
       4100-PROCESS-EXTRACTS-X.
           EXIT.
P01217 4500-PROCESS-EXTRACTS-XLS.
P01217     INITIALIZE        WS-XLS-LINE.
P01217*
P01217     IF R2110-APP-NUMBER    NOT  =    WS-PREV-APP-NUMBER
P01217        MOVE R2110-POLICY-ID          TO WS-XLS-POLICY-ID
P01217        MOVE R2110-APP-NUMBER         TO WS-XLS-APP-NUMBER
P01217        MOVE R2110-AGENT-CODE         TO WS-XLS-AGENT-CODE
P01217        MOVE R2110-BRANCH-CODE        TO WS-XLS-BRANCH-CODE
P01217        MOVE R2110-SO-CODE            TO WS-XLS-SO-CODE
P01217        MOVE R2110-REPORT-DT          TO WS-XLS-REPORT-DT
P01217        MOVE R2110-CLIENT-NUMBER      TO WS-XLS-CLIENT-NUMBER
P01217        IF R2110-CLI-SEX-CD = 'C'
P01217           MOVE R2110-CLI-CO-NM       TO WS-P1-CLI-NM
P01217        ELSE
P01217           MOVE R2110-CLI-GIV-NM      TO L0620-CLI-GIV-NM
P01217           MOVE R2110-CLI-SUR-NM      TO L0620-CLI-SUR-NM
P01217           PERFORM  0620-1000-FORMAT-SCREEN-NAME
P01217              THRU  0620-1000-FORMAT-SCREEN-NAME-X
P01217           MOVE L0620-SCREEN-NAME     TO WS-P1-CLI-NM
P01217        END-IF
P01217        MOVE WS-P1-CLI-NM             TO WS-XLS-CLI-NM
P01217        MOVE R2110-CLI-BTH-DT         TO WS-XLS-CLI-BTH-DT
P01217        MOVE R2110-CLI-SEX-CD         TO WS-XLS-CLI-SEX-CD
P01217        MOVE R2110-UW-TYP-CD          TO WS-XLS-UW-TYP-CD
MFFOP1*P01217* GET MY KEMPO INFORMATION FOR THE POLICY
MFFOP1*P01217 MOVE WPGWS-CRNT-PGM-ID        TO   L2490-TXT-SRC-ID
MFFOP1*B11215 MOVE WGLOB-EDIT-LANG          TO   L2490-TXT-LANG-CD 
MFFOP1*P01217 EVALUATE TRUE
MFFOP1*P01217     WHEN R2110-MY-KEMPO-TYP-NO
MFFOP1*P01217          MOVE SPACE          TO   WS-XLS-MY-KEMPO-TYP-CD
MFFOP1*P01217     WHEN R2110-MY-KEMPO-TYP-MATURITY
MFFOP1*P01217          MOVE '00001'        TO   L2490-TXT-SRC-REF-ID
MFFOP1*P01217          PERFORM   2490-1000-RETRIEVE-TEXT
MFFOP1*P01217              THRU   2490-1000-RETRIEVE-TEXT-X
MFFOP1*P01217          MOVE L2490-TXT-STR-TXT   TO   WS-XLS-MY-KEMPO-TYP-CD
MFFOP1*P01217     WHEN R2110-MY-KEMPO-TYP-MID-TERM
MFFOP1*P01217          MOVE '00002'        TO   L2490-TXT-SRC-REF-ID
MFFOP1*P01217          PERFORM   2490-1000-RETRIEVE-TEXT
MFFOP1*P01217              THRU   2490-1000-RETRIEVE-TEXT-X
MFFOP1*P01217          MOVE L2490-TXT-STR-TXT   TO   WS-XLS-MY-KEMPO-TYP-CD
MFFOP1*P01217     END-EVALUATE
MFFOP1*UCPOUT MOVE R2110-UCP-CD        TO   WS-XLS-UCP-CD    
UCPOUT        MOVE R2110-UCP-ISS-DT    TO   WS-XLS-UCP-ISS-DT
P01217        MOVE "UPLOAD"            TO   WS-XLS-DOC-ID
P01217        MOVE "500"               TO   WS-XLS-POL-500
P01217        MOVE WHDG-DATE           TO   WS-XLS-RPRT-DT
P01217        MOVE WS-XLS-LINE         TO   RPRT9-SEQ-REC-INFO
P01217        IF   WS-DATA-FIRST
P01217             SET  WS-NO-DATA-FIRST    TO   TRUE
P01217* PAGE ADVANCING NEEDED FOR FILES TO BE SENT TO ACTUATE SERVER
P01217             PERFORM   PRT9-2000-WRITE
P01217                  THRU PRT9-2000-WRITE-X
P01217        ELSE
P01217             MOVE +1             TO   WPRT9-NUMBER-LINES
P01217             PERFORM   PRT9-1000-WRITE
P01217                  THRU PRT9-1000-WRITE-X
P01217        END-IF
P01217     END-IF.
P01217 4500-PROCESS-EXTRACTS-XLS-X.
P01217     EXIT.
      /
M16826*---------------------      
M16826 5000-GET-CWA-DATA.
M16826*---------------------
M16826
M16826     MOVE R2110-POLICY-ID             TO WPOL-POL-ID. 
M16826  
M16826     PERFORM  POL-1000-READ
M16826         THRU POL-1000-READ-X.
M16826
M16826     IF NOT WPOL-IO-OK
M16826        GO TO  5000-GET-CWA-DATA-X
M16826     END-IF.
M16826
M16826     IF  RPOL-INIT-PMT-TYP-DIRECT
M16826         MOVE LOW-VALUES              TO WCWAR-KEY
M16826         MOVE HIGH-VALUES             TO WCWAR-ENDBR-KEY
M16826         MOVE R2110-POLICY-ID         TO WCWAR-POL-ID 
M16826                                         WCWAR-ENDBR-POL-ID
M16826         PERFORM  CWAR-1000-BROWSE
M16826             THRU CWAR-1000-BROWSE-X
M16826  
M16826         IF NOT WCWAR-IO-OK
M16826            PERFORM  CWAR-3000-END-BROWSE
M16826                THRU CWAR-3000-END-BROWSE-X
M16826            GO TO 5000-GET-CWA-DATA-X
M16826         END-IF
M16826
M16826         PERFORM  CWAR-2000-READ-NEXT
M16826             THRU CWAR-2000-READ-NEXT-X
M16826
M16826         IF NOT WCWAR-IO-OK 
M16826            MOVE SPACES               TO WS-P1-RECPT-DT
M16826            MOVE SPACES               TO WS-P1-RECPT-AMT
M16826            MOVE SPACES               TO WS-P1-RECPT-NUM
M16826         ELSE
M16826            MOVE RCWAR-RECPT-DT       TO WS-P1-RECPT-DT
M16826            MOVE WGLOB-EDIT-LANG      TO L9687-LANG-CD
M16826            MOVE RCWAR-RECPT-AMT      TO L9687-INPUT-AMT
M16826            SET  L9687-RQST-YEN-FMT   TO TRUE
M16826            PERFORM  9687-1000-FORMAT-AMT
M16826                THRU 9687-1000-FORMAT-AMT-X
M16826            MOVE L9687-OUTPUT-AMT     TO WS-P1-RECPT-AMT
M16826            MOVE RCWAR-RECPT-NUM      TO WS-P1-RECPT-NUM
M16826         END-IF
M16826  
M16826         PERFORM  CWAR-3000-END-BROWSE
M16826             THRU CWAR-3000-END-BROWSE-X
M16826     ELSE
M16826        MOVE WPGWS-CRNT-PGM-ID        TO L2490-TXT-SRC-ID
M16826        MOVE WGLOB-EDIT-LANG          TO L2490-TXT-LANG-CD 
M16826        MOVE '00003'                  TO L2490-TXT-SRC-REF-ID
M16826        PERFORM  2490-1000-RETRIEVE-TEXT
M16826            THRU 2490-1000-RETRIEVE-TEXT-X
M16826        MOVE L2490-TXT-STR-TXT        TO WS-P1-RECPT-DT
M16826        MOVE L2490-TXT-STR-TXT        TO WS-P1-RECPT-AMT
M16826        MOVE L2490-TXT-STR-TXT        TO WS-P1-RECPT-NUM
M16826     END-IF.
M16826
M16826 5000-GET-CWA-DATA-X.
M16826     EXIT.

      *---------------------
       7000-INIT-RUN-TITLES.
      *---------------------
 
      *
      * INITIALIZE RUN MESSAGES CONTROL REPORT TITLES
      *
 
           PERFORM  7900-INIT-COMMON-TITLES
               THRU 7900-INIT-COMMON-TITLES-X.
 
      *MSG: RUN MESSAGES
           MOVE 'XS00000153'          TO WGLOB-MSG-REF-INFO.
 
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO L0040-HDG-LINE-3.
 
           PERFORM  0040-1000-INIT-TITLE
               THRU 0040-1000-INIT-TITLE-X.
 
      *
      * INITIALIZE IMPORT AUDIT TITLES
      *
 
           MOVE SPACES                    TO WHDG-LINE-1.
           MOVE SPACES                    TO WHDG-LINE-2.
           MOVE SPACES                    TO WS-REPORT-LINES.
           MOVE SPACES                    TO WS-REPORT-LINES-2.
 
           PERFORM  HDG-1000-INIT-CONSTANTS
               THRU HDG-1000-INIT-CONSTANTS-X.
 
           MOVE L0040-SYSTEM-ID           TO WHDG-SYSTEM-ID.
           MOVE L0960-COMPANY-NAME        TO WHDG-COMPANY-NAME.
 
APEX53     MOVE WGLOB-MAIN-PGM-ID         TO WHDG-PROGRAM-ID.
           MOVE WGLOB-SYSTEM-DATE-INT     TO L1640-INTERNAL-DATE.
 
           PERFORM  1640-2000-INTERNAL-TO-EXT
               THRU 1640-2000-INTERNAL-TO-EXT-X.
 
           MOVE L1640-EXTERNAL-DATE       TO WHDG-DATE.
           MOVE WGLOB-SYSTEM-TIME         TO WTIME-EDIT-TIME.
 
           PERFORM  TIME-1000-REFORMAT
               THRU TIME-1000-REFORMAT-X.
 
           MOVE WTIME-DISPLAY-TIME        TO WHDG-TIME.
      *MSG: NEWBUS IMPORT AUDIT REPORT
           MOVE 'AS21100001'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO WHDG-REPORT-TITLE.
      *MSG:APPLICATION       CMP POLICY           AGENT       STICKER ID 
           MOVE 'AS21100004'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO WS-HEADING-PART-1.
      *MSG: CLIENT
           MOVE 'AS21100005'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO WS-HEADING-PART-2.
MFFOP1**MSG: NUMBER            CDE NUMBER    BRANCH NUMBER
MFFOP1*    MOVE 'AS21100006'              TO WGLOB-MSG-REF-INFO.
MFFOP1*    PERFORM  0260-1000-GENERATE-MESSAGE
MFFOP1*        THRU 0260-1000-GENERATE-MESSAGE-X.
 
MFFOP1*    MOVE WGLOB-MSG-TXT             TO WS-HEADING-PART-3.
MFFOP1**MSG: NUMBER     PRODUCT
MFFOP1*    MOVE 'AS21100007'              TO WGLOB-MSG-REF-INFO.
MFFOP1*    PERFORM  0260-1000-GENERATE-MESSAGE
MFFOP1*        THRU 0260-1000-GENERATE-MESSAGE-X.
 
MFFOP1*    MOVE WGLOB-MSG-TXT             TO WS-HEADING-PART-4.
M16826* MSG: NUMBER            CDE NUMBER    BRANCH NUMBER
M16826     MOVE 'AS21100006'                TO WGLOB-MSG-REF-INFO.
M16826     PERFORM  0260-1000-GENERATE-MESSAGE
M16826         THRU 0260-1000-GENERATE-MESSAGE-X.
M16826 
M16826     MOVE WGLOB-MSG-TXT               TO WS-HEADING-PART-3.
M16826*MSG: NUMBER     PRODUCT
M16826     MOVE 'AS21100007'                TO WGLOB-MSG-REF-INFO.
M16826     PERFORM  0260-1000-GENERATE-MESSAGE
M16826         THRU 0260-1000-GENERATE-MESSAGE-X.
M16826 
M16826     MOVE WGLOB-MSG-TXT               TO WS-HEADING-PART-4.
           MOVE +99                       TO WS-LINE-CNTR.
           MOVE ZERO                      TO WS-PAGE-CNTR.
 
       7000-INIT-RUN-TITLES-X.
           EXIT.
      /
      *------------------------
       7900-INIT-COMMON-TITLES.
      *------------------------
 
      *
      * INITIALIZE FIELDS COMMON TO BOTH RUN AND TOTAL CONTROL
      * REPORTS
      *
 
      *
      * SET UP THE COMPANY NAME
      *
 
           MOVE L0960-COMPANY-NAME        TO L0040-COMPANY-NAME.
 
      *
      * GET THE PROGRAM DESCRIPTION
      *
 
      *MSG: NEWBUS IMPORT AUDIT REPORT
           MOVE 'AS21100001'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO L0040-PROGRAM-DESC.
 
      *
      * GET THE SYSTEM DESCRIPTION
      *
 
      *MSG: INGENIUM 5.4
           MOVE 'XS00000145'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO L0040-SYSTEM-ID.
 
       7900-INIT-COMMON-TITLES-X.
           EXIT.
      /
      *------------------
       8000-PRINT-TOTALS.
      *------------------
 
           ADD WS-RECORDS-IN-COMPANY  TO WS-RECORDS-IN-TOTAL.
           MOVE ZEROS                 TO WS-RECORDS-IN-COMPANY.
            
      *MSG: TOTAL NUMBER OF APPLICATIONS IMPORTED : (@1)
           MOVE 'AS21100003'          TO WGLOB-MSG-REF-INFO.
           MOVE WS-RECORDS-IN-TOTAL   TO WGLOB-MSG-PARM (1).
 
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO L0040-INPUT-LINE.
 
           PERFORM  0040-3000-WRITE-OTHER
               THRU 0040-3000-WRITE-OTHER-X.
 
 
      *MSG: ***** END OF REPORT *****
           MOVE 'AS21100008'              TO WGLOB-MSG-REF-INFO.
           PERFORM  0260-1000-GENERATE-MESSAGE
               THRU 0260-1000-GENERATE-MESSAGE-X.
 
           MOVE WGLOB-MSG-TXT             TO WS-END-OF-RPT-TXT.
            
Q17251*B10065     MOVE +5                        TO WPRT1-NUMBER-LINES.
Q17251*B10065     MOVE WS-END-OF-REPORT-LINE     TO RPRT1-SEQ-REC-INFO.
Q17251*B10065
Q17251*B10065     PERFORM  PRT1-1000-WRITE
Q17251*B10065         THRU PRT1-1000-WRITE-X.
Q17251
Q17251     MOVE +5                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE WS-END-OF-REPORT-LINE     TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.

 
       8000-PRINT-TOTALS-X.
           EXIT.
      /
      *--------------------
Q17251* 8200-PRINT-HEADINGS.
      *--------------------
 
      *
      * INITIALIZE REMAINING FIELDS IN TOP 2 HEADING LINES AND PRINT
      *
 
Q17251*    ADD +1                         TO WS-PAGE-CNTR.
Q17251*    MOVE WS-PAGE-CNTR              TO WHDG-PAGE.
Q17251*007684     MOVE WHDG-LINE-1               TO RPRT1-SEQ-REC-INFO.
Q17251* 
Q17251*    PERFORM  PRT1-2000-WRITE
Q17251*        THRU PRT1-2000-WRITE-X.
Q17251*
Q17251*    MOVE +1                        TO WPRT1-NUMBER-LINES.
Q17251*007684     MOVE WHDG-LINE-2               TO RPRT1-SEQ-REC-INFO.
Q17251*
Q17251*    PERFORM  PRT1-1000-WRITE
Q17251*        THRU PRT1-1000-WRITE-X.
Q17251*
Q17251*    MOVE +1                        TO WPRT1-NUMBER-LINES.
Q17251*007684     MOVE SPACES                    TO RPRT1-SEQ-REC-INFO.
Q17251*
Q17251*    PERFORM  PRT1-1000-WRITE
Q17251*        THRU PRT1-1000-WRITE-X.
Q17251*
Q17251*    MOVE +2                        TO WPRT1-NUMBER-LINES.
Q17251*007684     MOVE WS-REPORT-LINES           TO RPRT1-SEQ-REC-INFO.
Q17251*
Q17251*    PERFORM  PRT1-1000-WRITE
Q17251*        THRU PRT1-1000-WRITE-X.
Q17251*
Q17251*APEX52     MOVE +1                        TO WPRT1-NUMBER-LINES.
Q17251*007684     MOVE WS-REPORT-LINES-2         TO RPRT1-SEQ-REC-INFO.
Q17251*
Q17251*    PERFORM  PRT1-1000-WRITE
Q17251*        THRU PRT1-1000-WRITE-X.
Q17251*
P00103*    MOVE +1                        TO WPRT1-NUMBER-LINES.
P00103*    MOVE SPACES                    TO RPRT1-SEQ-REC-INFO.
Q17251*
P00103*    PERFORM  PRT1-1000-WRITE
P00103*        THRU PRT1-1000-WRITE-X.
Q17251*
Q17251*    MOVE ZERO                      TO WS-LINE-CNTR.
Q17251*
Q17251*8200-PRINT-HEADINGS-X.
Q17251*    EXIT.
      /
Q17251*--------------------
Q17251 8250-PRINT-HEADINGS.
Q17251*--------------------
Q17251*
Q17251* INITIALIZE REMAINING FIELDS IN TOP 2 HEADING LINES AND PRINT
Q17251*
Q17251     ADD +1                         TO WS-PAGE-CNTR.
Q17251     MOVE WS-PAGE-CNTR              TO WHDG-PAGE.
Q17251     MOVE WHDG-LINE-1               TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-2000-WRITE
Q17251         THRU PRTA-2000-WRITE-X.
Q17251
Q17251     MOVE +1                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE WHDG-LINE-2               TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     MOVE +1                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE SPACES                    TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     MOVE +2                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE WS-REPORT-LINES           TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     MOVE +1                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE WS-REPORT-LINES-2         TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     MOVE +1                        TO WPRTA-NUMBER-LINES.
Q17251     MOVE SPACES                    TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     MOVE ZERO                      TO WS-LINE-CNTR.
Q17251
Q17251 8250-PRINT-HEADINGS-X.
Q17251     EXIT.
      /      
      *----------------
Q17251* 8300-PRINT-LINE.
      *----------------
 
      *
      * PRINT A LINE ON THE REPORT
      *
  
Q17251*    IF  WS-LINE-CNTR > WS-MAX-LINES 
Q17251*        PERFORM  8200-PRINT-HEADINGS
Q17251*            THRU 8200-PRINT-HEADINGS-X
Q17251*    END-IF.
Q17251*
Q17251*007684     MOVE WS-PRINT-LINE             TO RPRT1-SEQ-REC-INFO.
Q17251* 
Q17251*     PERFORM  PRT1-1000-WRITE
Q17251*         THRU PRT1-1000-WRITE-X.
Q17251* 
Q17251*     ADD WPRT1-NUMBER-LINES         TO WS-LINE-CNTR.
Q17251* 
Q17251* 8300-PRINT-LINE-X.
Q17251*    EXIT.

Q17251*----------------
Q17251 8350-PRINT-LINE.
Q17251*----------------
Q17251*
Q17251* PRINT A LINE ON THE REPORT
Q17251*
Q17251     IF  WS-LINE-CNTR > WS-MAX-LINES 
Q17251     OR  R2110-BRANCH-CODE NOT = WS-PREV-BRANCH-CODE
Q17251     OR  R2110-SO-CODE NOT = WS-PREV-SO-CODE
Q17251         PERFORM  8250-PRINT-HEADINGS
Q17251             THRU 8250-PRINT-HEADINGS-X
Q17251     END-IF.
Q17251
Q17251     MOVE WS-PRINT-LINE             TO RPRTA-REC-DETAIL.
Q17251
Q17251     PERFORM  PRTA-1000-WRITE
Q17251         THRU PRTA-1000-WRITE-X.
Q17251
Q17251     ADD WPRTA-NUMBER-LINES         TO WS-LINE-CNTR.
Q17251
Q17251 8350-PRINT-LINE-X.
Q17251     EXIT.           
P00159/
P00159*--------------------
P00159 8400-PRINT-HEADINGS2.
P00159*--------------------
P00159
P00159*
P00159* INITIALIZE REMAINING FIELDS IN TOP 2 HEADING LINES AND PRINT
P00159*
P00159
P00159     ADD +1                         TO WS-PAGE-CNTR2.
P00159     MOVE WS-PAGE-CNTR2             TO WHDG-PAGE.
P00159     MOVE WHDG-LINE-1               TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-2000-WRITE
P00159         THRU PRT2-2000-WRITE-X.
P00159
P00159     MOVE +1                        TO WPRT2-NUMBER-LINES.
P00159     MOVE WHDG-LINE-2               TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159
P00159     MOVE +1                        TO WPRT2-NUMBER-LINES.
P00159     MOVE SPACES                    TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159
P00159     MOVE +2                        TO WPRT2-NUMBER-LINES.
P00159     MOVE WS-REPORT-LINES           TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159
P00159     MOVE +1                        TO WPRT2-NUMBER-LINES.
P00159     MOVE WS-REPORT-LINES-2         TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159          
P00159     MOVE +1                        TO WPRT2-NUMBER-LINES.
P00159     MOVE SPACES                    TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159
MFFOP1*P00159 8200-PRINT-HEADINGS2-X.
MFFOP1 8400-PRINT-HEADINGS2-X.
P00159     EXIT.
P00159/
P00159*----------------
P00159 8500-PRINT-LINE2.
P00159*----------------
P00159
P00159*
P00159* PRINT A LINE ON THE REPORT
P00159*
P00159
P00159     MOVE WS-PRINT-LINE             TO RPRT2-SEQ-REC-INFO.
P00159
P00159     PERFORM  PRT2-1000-WRITE
P00159         THRU PRT2-1000-WRITE-X.
P00159
P00159 8500-PRINT-LINE2-X.
P00159     EXIT.
P00159/
Q17251*----------------------
Q17251 8600-BUILD-PRTA-KEYS.
Q17251*----------------------
Q17251
Q17251     MOVE SPACES                      TO WS-RO-KEY.
Q17251     MOVE SPACES                      TO WS-SO-KEY.
Q17251     MOVE R2110-BRANCH-CODE           TO WS-RO-ID.
Q17251     MOVE '000'                       TO WS-RO-ZERO.
Q17251     MOVE WS-RO-ID                    TO WS-SO-BR.
Q17251     MOVE R2110-SO-CODE               TO WS-SO-SO.
Q17251     MOVE WS-RO-KEY                   TO WPRTA-KEY1.
Q17251     MOVE WS-SO-KEY                   TO WPRTA-KEY2.
Q17251     MOVE SPACES                      TO WPRTA-KEY3.
Q17251     MOVE SPACES                      TO WPRTA-KEY4.
Q17251     MOVE SPACES                      TO WPRTA-KEY5.
Q17251
Q17251 8600-BUILD-PRTA-KEYS-X.
Q17251     EXIT.
Q17251/
      *-----------------
       9000-CLOSE-FILES.
      *-----------------

P00045*    PERFORM  2110-4000-CLOSE
P00045*        THRU 2110-4000-CLOSE-X.
 
P00045     PERFORM  2110-5000-CLOSE
P00045         THRU 2110-5000-CLOSE-X.
 
Q17251*     PERFORM  PRT1-4000-CLOSE
Q17251*         THRU PRT1-4000-CLOSE-X.

Q17251     PERFORM  PRTA-4000-CLOSE
Q17251         THRU PRTA-4000-CLOSE-X.
 
P00159     PERFORM  PRT2-4000-CLOSE
P00159         THRU PRT2-4000-CLOSE-X.
 
P01217     PERFORM  PRT9-4000-CLOSE
P01217         THRU PRT9-4000-CLOSE-X.
P01217
           PERFORM  OCF-4000-CLOSE
               THRU OCF-4000-CLOSE-X.
 
       9000-CLOSE-FILES-X.
           EXIT.
      /
      ******************************************************************
      *   PROCESSING COPYBOOKS
      ******************************************************************
 
P02229 COPY XCPL0035.

       COPY NCPL0960.
      /
       COPY XCPL0040.
      /
       COPY XCPL0260.
      /
       COPY XCPL1640.
      /
       COPY XCPPHDG.
      /
       COPY XCPPTIME.
      /
B10065 COPY CCPNEDIT.
P00103/ 
P00103 COPY CCPL0620.
      /
MFFOP1*PR006Q COPY XCPL2490.
M16826 COPY XCPL2490.
M16826 COPY XCPS0290.
M16826 COPY XCPL0290.

      ******************************************************************
      *   FILE I/O COPYBOOKS
      ******************************************************************
 
P00045*COPY ACPL2110.
P00045*COPY ACPN2110.
P00045*COPY ACPO2110.
P00045 COPY ACPI2110.
M16826 COPY CCPNPOL.
M16826 COPY CCPBCWAR.
M16826 COPY XCPL9687.
M16826 COPY XCPS9687.
      /
       COPY XCPLOCF.
       COPY XCPOOCF.
      /
Q17251* COPY NCPIPRT1.
Q17251 COPY CCPIPRTA.
P00159/
P00159 COPY NCPIPRT2.
P01217 COPY NCPIPRT9.
      /
       COPY XCPL0030.
 
      *****************************************************************
      **                 END OF PROGRAM ASBM2110                     **
      *****************************************************************
